import sys
input = sys.stdin.readline

s1 = input().strip()
s2 = input().strip()
cache = [0] * len(s1) # 캐시를 1차원 배열로 구현

for i in range(len(s2)):
    temp = 0 # 누적 최대값 변수
    for j in range(len(s1)):
        if temp < cache[j]:
            temp = cache[j]
        elif s2[i] == s1[j]:
            cache[j] = temp + 1
        # print(s2[i], s1[j], cache)

print(max(cache))

# C A [0, 0, 0, 0, 0, 0]
# C C [0, 1, 0, 0, 0, 0]
# C A [0, 1, 0, 0, 0, 0]
# C Y [0, 1, 0, 0, 0, 0]
# C K [0, 1, 0, 0, 0, 0]
# C P [0, 1, 0, 0, 0, 0]
# A A [1, 1, 0, 0, 0, 0]
# A C [1, 1, 0, 0, 0, 0]
# A A [1, 1, 2, 0, 0, 0]
# A Y [1, 1, 2, 0, 0, 0]
# A K [1, 1, 2, 0, 0, 0]
# A P [1, 1, 2, 0, 0, 0]
# P A [1, 1, 2, 0, 0, 0]
# P C [1, 1, 2, 0, 0, 0]
# P A [1, 1, 2, 0, 0, 0]
# P Y [1, 1, 2, 0, 0, 0]
# P K [1, 1, 2, 0, 0, 0]
# P P [1, 1, 2, 0, 0, 3]
# C A [1, 1, 2, 0, 0, 3]
# C C [1, 2, 2, 0, 0, 3]
# C A [1, 2, 2, 0, 0, 3]
# C Y [1, 2, 2, 0, 0, 3]
# C K [1, 2, 2, 0, 0, 3]
# C P [1, 2, 2, 0, 0, 3]
# A A [1, 2, 2, 0, 0, 3]
# A C [1, 2, 2, 0, 0, 3]
# A A [1, 2, 3, 0, 0, 3]
# A Y [1, 2, 3, 0, 0, 3]
# A K [1, 2, 3, 0, 0, 3]
# A P [1, 2, 3, 0, 0, 3]
# K A [1, 2, 3, 0, 0, 3]
# K C [1, 2, 3, 0, 0, 3]
# K A [1, 2, 3, 0, 0, 3]
# K Y [1, 2, 3, 0, 0, 3]
# K K [1, 2, 3, 0, 4, 3]
# K P [1, 2, 3, 0, 4, 3]